# Install GNU core utilities (those that come with OS X are outdated)
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# basics
brew 'curl'
brew 'git'
brew 'zsh'
brew 'python'
brew 'vim'
brew 'chezmoi'

# dev
brew 'neovim'
brew 'ripgrep'
brew 'mise'
brew 'fzf'
brew 'git-delta'
brew 'tmux'
brew 'git-extras'
brew 'pcre'
brew 'gh'             # GitHub CLI; Claude Code uses for PR workflow
brew 'jq'             # JSON processor
brew 'yq'             # YAML processor
brew 'bat'            # better cat with syntax highlighting
brew 'eza'            # modern ls
brew 'zoxide'         # smart cd
brew 'gum'            # bash interactive prompts (used by scripts)

# writing
brew 'pandoc'         # document conversion
brew 'glow'           # terminal markdown renderer

# shell scripting
brew 'shellcheck'     # bash linter
brew 'bats-core'      # bash test framework

# terminal
brew 'starship'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# audio ripping
brew 'yt-dlp'

# casks
cask 'ghostty'
cask 'font-jetbrains-mono'
cask 'alfred'
cask 'google-chrome'
cask '1password'
cask 'macvim'
cask 'rectangle'
cask 'marta'
cask 'nordvpn'
cask 'qbittorrent'
