# taps
tap 'homebrew/homebrew-cask'

# Install GNU core utilities (those that come with OS X are outdated)
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install other useful binaries
brew 'curl'
brew 'git'
brew 'zsh'
brew 'bandcamp-dl'
brew 'python'

# suppressed dev stuff for now
brew 'reattach-to-user-namespace'
brew 'the_silver_searcher'
brew 'tmux'
brew 'rbenv'
brew 'git-extras'
brew 'pcre'

# install casks
cask 'alfred'
cask '1password'
cask 'google-chrome'
cask 'dropbox'
cask 'musicbrainz-picard'
cask 'signal'
cask 'loopback'
cask 'zoom'
cask 'obsidian'
cask 'iterm2'
cask 'macvim'
cask 'spotify'
cask 'the-unarchiver'
cask 'synology-drive'
cask 'nordvpn'
cask 'microsoft-remote-desktop'
cask 'yacreader'
cask 'discord'
cask 'dungeon-crawl-stone-soup-tiles'
